package FinancialOperationsDraft;

/**
 * Счет
 * - это уникальная запись которая отображает кол - во денег
 *
 * Операции со счетом
 * • Пополнение
 * ◦ нельзя пополнить счет суммой 0 или меньше
 * • Снятие
 * ◦ нельзя снять денег, больше чем есть на балансе
 * ◦ снятие денег возможно при положительном балансе
 * • Перевод - с одного счета, другому
 * ◦ Равнозначно операциям снятия и пополнения
 * • Дополнительные операции
 * ◦ Заем/Кредит
 * ◦ Списание процентов по кредиту
 * ◦ Просрочка
 */
public class Account {
}
