;push/pop + массив в стеке (1.5 часа)
;rbp - база кадра стека
;rsp - вершина стека
;
;push rbp - переместить базу на вершину стека -> "запомнить" адрес начала текущего кадра
;mov rbp, rsp - сделать текущую вершину базой кадра -> создать новый "вложенный" кадр , "подстек"
;sub rsp, 40 - определить размер стека - количество байт в кадре = новая вершина - новая база = 40
;память[rbp-40 : rbp]

;пример - существует память
;
;rbp1=0x401014
;------------
;
;------------
;------------
;------------
;
;rsp1=0x401000
;------------
;
;ТРЕБУЕТСЯ СОЗДАТЬ КАДР СТЕКА 42 БАЙТА
;
;1 - СОЗДАТЬ БАЗУ КАДРА (УСЛОВНО RBP2)
;mov rbp, rsp
;rbp1=0x401014
;------------
;
;------------
;------------
;------------
;
;rbp2=rsp1=0x401000
;------------

;2 - ОПРЕДЕЛИТЬ 42 БАЙТА ДЛЯ СТЕКА - СОЗДАТЬ ВЕРШИНУ КАДРА (УСЛОВНО RSP2)
;sum rsp, 42
;rbp1=0x401014
;------------
;
;------------
;------------
;------------
;
;rbp2=rsp1=0x401000
;------------
;------------
;------------
;
;rsp2=rbp2-42=0x400fd6
;------------

default rel

